# config.py

DOC_TEMPLATES = {
    "ТТН: Фрукты": {
        "FIELDS": {
            "Отправитель": "string",
            "Получатель": "string"
        },
        "TABLES": {
            "Таблица товаров": {
                "Товар": "string", 
                "Количество": "number",
                "Стоимость": "number",
                "Доставка": "number",
                "Разгрузка": "string",
                "Всего": "number"
            },
            "Таблица адресов": {
                "Товар": "string",
                "Адрес": "string"
            }
        }
    },
    "ТТН: Расчет услуг": {
        "FIELDS": {
            "Отправитель": "string",
            "Получатель": "string"
        },
        "TABLES": {
            "Расчет стоимости": {
                "Услуга": "string", 
                "За тонны": "number",
                "За тонно-км": "number",
                "Погрузочно_Разгрузочные": "string",
                "Недогрузка": "string",
                "Экспедирование": "string",
                "За срочность": "number",
                "За спецтранспорт": "number",
                "Прочие доплаты": "number",
                "Всего": "number"
            },
            "Адрес и Количество": {
                "Пункт": "string",
                "Расстояние": "number",
                "Количество": "number"
            }
        }
    }
}